# Pandas_09

In [3]:
#Import The Libriary
import pandas as pd

In [4]:
#Create The Data Frame 
df1 =pd.DataFrame({"city": ["new york","chicago","orlando"],
    "temperature": [21,14,35]})

In [5]:
#Print The Data Frame
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [6]:
#Create The Data Frame 
df2 =pd.DataFrame({"city": ["new york","chicago","orlando"],
    "humidity": [51,44,45]})

In [7]:
#Print The Data Frame
df2

       city  humidity
0  new york        51
1   chicago        44
2   orlando        45

In [8]:
#Merge The Data Frame
df3 = pd.merge(df1,df2,on= 'city')

In [9]:
#Print The Data Frame
df3

       city  temperature  humidity
0  new york           21        51
1   chicago           14        44
2   orlando           35        45

## Type Of DataBase Joins

In [13]:
#Create The Data Frame
df5 = pd.DataFrame(
    {
        "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38]
                   }
                  )

In [14]:
#Print The Data Frame
print(df5)

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [15]:
#Create The Data Frame 
df6 =pd.DataFrame({"city": ["new york","chicago","orlando"],
    "humidity": [51,44,45]})

In [16]:
#Print The Data Frame
print(df6)

       city  humidity
0  new york        51
1   chicago        44
2   orlando        45

In [17]:
#Merge The Data Frame By Inner
df8=pd.merge(df5,df6,on="city",how="inner")

In [18]:
#Print The Data Frame
df8

       city  temperature  humidity
0  new york           21        51
1   chicago           14        44
2   orlando           35        45

In [21]:
#Merge The Data Frame By Outer
df9=pd.merge(df5,df6,on="city",how="outer")

In [22]:
#Print Data Frame
df9

        city  temperature  humidity
0   new york           21      51.0
1    chicago           14      44.0
2    orlando           35      45.0
3  baltimore           38       NaN

In [23]:
#Merge The Data Frame By Left
df10=pd.merge(df5,df6,on="city",how="left")

In [24]:
#Print Data Frame
df10

        city  temperature  humidity
0   new york           21      51.0
1    chicago           14      44.0
2    orlando           35      45.0
3  baltimore           38       NaN

In [25]:
#Merge The Data Frame By Right
df13=pd.merge(df5,df6,on="city",how="right")

In [26]:
#Print Data Frame
df13

       city  temperature  humidity
0  new york           21        51
1   chicago           14        44
2   orlando           35        45

## indicator flag

In [28]:
#Merge The Data Frame 
df15=pd.merge(df5,df6,on="city",how="outer",indicator=True)

In [29]:
#Print Data Frame
df15

        city  temperature  humidity     _merge
0   new york           21      51.0       both
1    chicago           14      44.0       both
2    orlando           35      45.0       both
3  baltimore           38       NaN  left_only

In [31]:
#Create The Data Frame
df20 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})

In [32]:
#Print The Data Frame
df20

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [33]:
#Create The Data Frame
df51= pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})

In [34]:
#Print The Data Frame
df51

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [38]:
#Print The Data Frame
df20

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [39]:
#Merge The Data Frame
df21= pd.merge(df20,df51,on="city",how="outer", suffixes=('_first','_second'))

In [40]:
#Print The Data Frame
df21

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,new york,21.0,65.0,14.0,68.0
1,chicago,14.0,68.0,21.0,65.0
2,orlando,35.0,71.0,NaN,NaN
3,baltimore,38.0,75.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

## join

In [42]:
#Create The Data Frame
df100 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df100.set_index('city',inplace=True)

In [44]:
#Print The Data Frame
df100

          temperature
city
new york           21
chicago            14
orlando            35

In [45]:
#Create The Data Frame
df200 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df200.set_index('city',inplace=True)

In [46]:
#Print The Data Frame
df200

          humidity
city
chicago         65
new york        68
orlando         75

In [47]:
#Join The Data Frame
df100.join(df200,lsuffix='_l', rsuffix='_r')

          temperature  humidity
city
new york           21        68
chicago            14        65
orlando            35        75

-------------------------------------------------------------------------------------------------------------------------------